package cn.itcast.day06.demo03;

/**
 * 局部变量和成员变量
 *
 * 1. 定义的位置不一样[重点]
 *  局部变量: 方法内部
 *  成员变量: 方法外部, 直接写在类当中.
 *
 * 2. 作用范围不一样[重点]
 *  局部变量: 只有方法当中才可以使用, 出了方法就不能再用.
 *  成员变量: 整个类全都可以通用
 *
 * 3. 默认值不一样[重点]
 * 局部变量:没有默认值, 如果要像使用, 就碧玺手动进行赋值
 * 成员变量: 如果没有赋值, 会有默认值, 规则和数组一样.
 *
 * 4. 内存位置不一样(了解)
 *
 * 局部变量: 栈内存
 * 成员变量:堆内存
 *
 * 5 生命周期(了解)
 * 局部变量: 随着方法进栈而诞生, 随着方法出栈而消失
 * 成员变量: 随着对象创建而诞生, 随着对象呗垃圾回收而消失.
 */
public class Demo01VariableDifference {

    String name;    //成员变量

    public void methodA(){
        int num = 20;   //局部变量
    }




}
